{"pageProps":{"frontmatter":{"title":"Optimize your data fetching with React Query","description":"So much more than a request framework","date":"2022-12-23","slug":"/posts/react-query","isPublished":true},"content":"\nI’ve been introduced to React Query at work last year and I wouldn’t be the first to say that it was a bit jarring initially. For the sake of personal growth, let’s document an introduction to it with actual use cases !\n\n> The complete Codesandbox with examples is available [here](https://codesandbox.io/s/react-query-seh4sj).\n\n## What’s React Query?\n\nReact Query is a library for managing asynchronous data in React applications. It helps with tasks such as fetching, caching & updating data.\n\nAt a high level, React Query works by providing a set of hooks that can be used to fetch and manage data. These hooks allow developers to declaratively specify the data that their components need, and React Query takes care of the rest.\n\n## Chris, show me an example please 😬\n\nLet’s check out a basic example:\n\n```jsx\nimport { useQuery } from \"react-query\";\n\nfunction BasicExample() {\n  const { data, isLoading, error } = useQuery(\"fetch-user-example\", () => {\n    return fetch(\"https://random-data-api.com/api/v2/users\").then((res) =>\n      res.json()\n    );\n  });\n\n  if (isLoading) {\n    return <div>Loading...</div>;\n  }\n\n  if (error) {\n    return <div>An error occurred: {error.message}</div>;\n  }\n\n  return (\n    <>\n      <h1>Basic example of data fetching</h1>\n      <div>Random user: {data.username}</div>\n    </>\n  );\n}\n```\n\nIn this example, the **`useQuery`** hook is used to fetch data from the **`/api/v2/users`** endpoint. The hook takes two arguments: a key and a function that returns a promise. The key is used to uniquely identify the data being fetched, and the function is responsible for making the network request and returning a promise that resolves with the data.\n\n## What about the other cool things React Query can do?\n\nReact Query is so much more than just a request framework it offers a lot of tools such as **caching, refetching, pre-fetching & pagination**. Let’s go over them one by one and see why they might justify using this library.\n\n### Caching\n\nOne of the key features of React Query is its ability to cache data. When a component makes a request for data using one of the React Query hooks, the library will first check its cache to see if the data is already available. If it is, React Query will return the cached data immediately, eliminating the need to make a network request. This can greatly improve the performance of an application, especially when dealing with data that doesn't change very frequently (for example, on an online training platform offering static courses).\n\n### Refetching\n\nReact Query allows you to refetch data when certain conditions are met, such as when a component is re-rendered or when the user navigates to a new page. This helps ensure that data is always up-to-date and consistent across your application.\n\nLet’s take our previous example and check out how it works in action:\n\n```jsx\nimport { useQuery } from \"react-query\";\n\nfunction Refetching() {\n  // The hook returns a refetch method that can be called anytime\n  const { data, isLoading, error, refetch } = useQuery(\n    \"refetch-user-example\",\n    () => {\n      return fetch(\"https://random-data-api.com/api/v2/users\").then((res) =>\n        res.json()\n      );\n    }\n  );\n\n  function handleRefetch() {\n    refetch();\n  }\n\n  if (isLoading) {\n    return <div>Loading...</div>;\n  }\n\n  if (error) {\n    return <div>An error occurred: {error.message}</div>;\n  }\n\n  return (\n    <>\n      <h1>Refetching</h1>\n      <div className=\"wrapper\">\n        <div>Random user: {data.username}</div>\n        <button onClick={handleRefetch}>Refetch</button>\n      </div>\n    </>\n  );\n}\n```\n\n### Pre-fetching\n\nLet’s say your user might need certain data soon, then you can use React Query’s pre-fetching functionality to optimize the performance of your application. This way you can show it almost instantly to your user once they will actually need it.\n\nOnce more, let’s build up our example with pre-fetching:\n\n```jsx\nimport React, { useEffect, useState } from \"react\";\nimport { useQuery, useQueryClient } from \"react-query\";\n\nfunction Prefetching() {\n  const [showData, setShowData] = useState(false);\n  const queryClient = useQueryClient();\n\n  const fetchData = () => {\n    return fetch(\"https://random-data-api.com/api/v2/users\").then((res) =>\n      res.json()\n    );\n  };\n\n  const { data, isLoading, error } = useQuery(\n    \"prefetch-user-example\",\n    fetchData\n  );\n\n  useEffect(() => {\n    // Data will be prefetched here once the component is mounted\n    queryClient.prefetchQuery(\"prefetch-user-example\", fetchData);\n  }, [queryClient]);\n\n  if (isLoading) {\n    return <div>Loading...</div>;\n  }\n\n  if (error) {\n    return <div>An error occurred: {error.message}</div>;\n  }\n\n  return (\n    <>\n      <h1>Prefetching</h1>\n      <button onClick={() => setShowData(true)}>Show prefetched data</button>\n      {showData && <p>{data.username}</p>}\n    </>\n  );\n}\n```\n\n### Pagination\n\nWhat if you want infinite scrolling or pagination for your website? When working with large datasets it’s often impractical (and downright not recommended, depending on your use case) to load all the data at once. React Query makes it easy to paginate data and load new pages as needed, while also providing the ability to infinitely scroll through large datasets.\n\nHere’s what a basic example would look like:\n\n```jsx\nimport React, { useState } from \"react\";\nimport { useQuery } from \"react-query\";\n\nfunction MyComponent() {\n  const [page, setPage] = useState(1);\n  const { data, isLoading, error } = useQuery(\n    [\"pagination-example\", page],\n    () => {\n      return fetch(`/api/my-data?page=${page}`).then((res) => res.json());\n    },\n    { keepPreviousData: true }\n  );\n\n  function handleNextClick() {\n    setPage(page + 1);\n  }\n\n  function handlePrevClick() {\n    setPage(page - 1);\n  }\n\n  if (isLoading) {\n    return <div>Loading...</div>;\n  }\n\n  if (error) {\n    return <div>An error occurred: {error.message}</div>;\n  }\n\n  return (\n    <div>\n      {data.map((item) => (\n        <div key={item.id}>{item.name}</div>\n      ))}\n      <div>\n        <button onClick={handlePrevClick} disabled={page === 1}>\n          Previous\n        </button>\n        <button onClick={handleNextClick} disabled={!data.hasMore}>\n          Next\n        </button>\n      </div>\n    </div>\n  );\n}\n```\n\n### Rapid fire of other cool React Query features\n\n- Refetch on window focus (using the `refetchOnWindowFocus` option, that's `true` by default)\n- Cache invalidation, you can specify when the data is stale and should be refetched\n- Mutation functions, using a set of helper functions to create, update and delete data\n- Error handling using the `onError` callback or the error object returned by the query\n\n### Are there any risks when using React Query?\n\nAs with any framework out there, there's always the risk of introducing additional complexity to your codebase. React Query provides a lot of features and options for managing asynchronous data, and it can be tempting to use them all in an effort to optimize your application. However, this can lead to code that is difficult to understand and maintain, especially if you have multiple developers working on the same codebase.\n\nAnother risk to consider is the possibility of introducing performance issues. While React Query can greatly improve the performance of your application, make sure to use it correctly in order to avoid introducing new performance issues. For example, if you're using the **`keepPreviousData`** option to paginate data, it's important to use a cache key that's specific enough to avoid caching unrelated data. If you're not careful, you may end up with a large cache that negatively impacts the performance of your project.\n\nJust like any other library out there, it’s important to weigh the benefits and risks it may offer.\n\n## Conclusion\n\nOverall, React Query is a powerful tool for managing asynchronous data in React applications. Its caching and lifecycle management features make it easy to build performant and scalable applications, and its support for pagination and infinite scrolling make it well-suited for working with large datasets.\n\nOnce you get the hang of it, it's a very potent tool to add to your toolbelt and I hope this quick article pushed you over the edge to try it out.\n\nAs always I'd **love** to stay in touch on [Twitter](https://twitter.com/christo_kade) (which surprisingly, hasn't imploded yet) so feel free to connect with me there.\n"},"__N_SSG":true}