{"pageProps":{"frontmatter":{"title":"Optimizing the performance of my personal website","description":"Incremental changes for a faster first meaningful paint.","date":"2018-01-24","slug":"/posts/optimisation","isPublished":true},"content":"\nMy [personal website](https://christopherkade.com) has gone through **many** iterations of its front-end, more or less 4 of them so far (in less than a year). I find that rebuilding my website gives me a project outside of work to constantly work on, and allows me to apply acquired knowledge in a concrete manner. I'm also pretty picky when it comes to design, and I often get bored of the ones I've built in the past.\n\nBut one of the things I haven't truly tackled is performance. Why? Because I've always perceived my website as something that has very little information and that therefore should not require optimization of that sort. But the more I try to push the website's style, the more I realize that performance should be a priority for every project I work on.\n\nThis post goes over every aspect of performance I have considered while going through what I've learned and applied.\n\n<br><br>\n\n## Minifying my stylesheets\n\nIn order to remove some bytes from my file sizes, minifying my stylesheets seemed like an obvious first thing to do.\n\nThe great thing about **Angular CLI** is that when building my project for production, it automatically minifies my stylesheets for me.\n\n`ng build --env=prod`\n\nThe effects of the minification can be seen in the `styles.bundle.js` file generated in the `dist` folder.\n\nIn any case where this process would not be automatic, and when using a pre-processor like **Sass**, it is possible to configure it to automatically minify compiled CSS.\n\n<br><br>\n\n## Images\n\n<br>\n\n### Reducing image file sizes\n\nBy compressing the pictures of my [projects](https://christopherkade.com/projects) I was able to bring some images from 1.4 MB down to 50kB.\n\nI had to compress them at the cost of visual quality, but my images being divided by rows, this would not affect the user's experience. Many tools are available online such as [this](http://compressimage.toolur.com/) one.  \nWhen exporting and selecting the quality level, I have chosen the lowest level possible while keeping an acceptable quality.\n\n<br>\n\n### Using progressive JPEG\n\nProgressive JPEG are simple to create and have little to no performance penalty, the upside is that they appear sooner on the page itself.  \nIn order to change a JPEG to its progressive counterpart many tools are available [online](https://www.imgonline.com.ua/eng/make-jpeg-progressive-without-compression.php).\n\nThe difference is astonishing, dropping the fetching of the images down to [27ms - 101ms] coming from upwards of [361ms - 510ms].\n\n<br><br>\n\n## What else could be done?\n\nMany other forms of performance optimization could be applied, but some of them aren't relevant to this website:\n\n- Using async to load scripts\n- Avoiding inline / embedded code\n- Avoiding unnecessary dom manipulations\n- And many other little tweaks that influence a website's performance\n\nI hope this post will be a call to action for some of you to consider performance in your development choices, it's very rewarding to be able to see improvements on your projects and is an incremental task that must be considered at the beginning of every project.\n\nThanks for reading,  \n[@christo_kade](https://twitter.com/christo_kade)\n"},"__N_SSG":true}