{"pageProps":{"frontmatter":{"title":"Rewriting my website using Vue","description":"I was this close to making a Vue pun.","date":"2018-05-20","slug":"/posts/website-vue","isPublished":true},"content":"\nI finally started fiddling with [Vue](https://vuejs.org/) in my free time and I'm happy to say I've fallen in love with this framework.\n\nI'll go over the things I've learned and the changes I've had to implement in order to rewrite my website from Angular to Vue.\n\n<br><br>\n\n### Step 1: Understanding the framework\n\nVue is well known for being easy to use at first, and coming from an Angular background, the concepts were not that hard to understand.\n\nI knew I wanted to have an overview of the whole ecosystem (or at least the most well known elements of it), namely:\n\n- Vue\n- Vuex\n- Vue-router\n\nAfter digging around, I found multiple tutorials explaining these concepts in detail: [state management](https://alligator.io/vuejs/intro-to-vuex/), [routing](https://scotch.io/tutorials/getting-started-with-vue-router), [Vue 2](https://medium.com/codingthesmartway-com-blog/vue-js-2-quickstart-tutorial-2017-246195cfbdd2) and started coding a cost management application.\n\nNothing too fancy, it simply allowed me to understand component management via the multiple boxes and elements of my interface and state management via the management of prices and their mutation.\n\n<br><br>\n\n### Step 2: Rewriting `christopherkade.com`\n\nAfter hearing lots of good things over the performance of Vue, I wanted to take advantage of it by rewriting my personal website. This would allow me to understand the necessary changes for transitioning from an Angular to a Vue project and would allow me to fix multiple design issues.\n\nFirst things first, I had to initialize my project:\n\n```\n# install vue-cli\n$ npm install --global vue-cli\n# create a new project using the \"webpack\" template\n$ vue init webpack christopherkade.com\n# install dependencies and go!\n$ cd christopherkade.com\n$ npm install\n$ npm run dev\n```\n\nI now have an up and running Vue project and want to understand what will be needed in the near future:\n\n- Multiple components\n  - App (base component)\n  - Navigation\n  - Home\n  - Work\n  - Posts\n  - Side (for the side text with my title, not truly necessary but useful).\n- Routing\n  - '/' &rarr; Home\n  - '/work' &rarr; Work\n  - '/posts' &rarr; Posts\n  - '\\*' &rarr; Home\n\nTherefore, my root component's (`App`) template was as follows:\n\n```html\n<template>\n  <div id=\"app\">\n    <!-- Navigation -->\n    <navigation />\n    <!-- Side text -->\n    <side />\n    <!-- Content container (grey area) -->\n    <div class=\"content\">\n      <!-- Router -->\n      <router-view />\n    </div>\n  </div>\n</template>\n```\n\nWith multiple changes here and there, such as centralizing my styles, templates and scripts into single `.vue` files and changing my `*ngFor`s and `ngIf`s into `v-for` and `v-if`s I had a finished product with little to no problems.\n\nBoth websites were identical with one exception: Vue's performance was notable.\n\n<br><br>\n\n### Final thoughts\n\nIt has been a pleasure learning the ways of VueJS, and I will surely keep on using and learning this framework in the future.\n\nI've enjoyed multiple aspects of Vue:\n\n- Having a single file per component\n- Actually using JS and not JSX (I'm looking at you React)\n- The ease of use of its router\n- The use of a store to manage states\n- Vue-CLI\n- And many other little things that make the development process a pleasure.\n\nThanks for reading,  \n[@christo_kade](https://twitter.com/christo_kade)\n"},"__N_SSG":true}