{"pageProps":{"frontmatter":{"title":"Coding a desktop app with Electron and Angular","description":"Lots of apps you might use on a daily basis use Electron.","date":"2017-12-20","slug":"/posts/intro-electron","isPublished":true},"content":"\nEverybody knows about [Electron](https://electronjs.org/), it's one of those open-source tools that the community is really grateful for as it gives us the liberty to develop amazing things such as the text editor I'm currently using: [Atom](https://atom.io/).\n\nIf you're not familiar with Electron, it's a framework that allows anyone to develop **cross platform** desktop applications using Javascript, HTTP and CSS, pretty cool, huh?\n\nIn this blog post, we'll be coding a small app to track accomplishments (a glorified to-do application).\n\n<br><br>\n\n### Getting started\n\nSince Angular is my framework of choice to discover Electron, I'll be using the awesome bootstrapping project [angular-electron](https://github.com/maximegris/angular-electron) in order to get started as quickly as possible. This project offers great features, such as packaging my app into executables for Linux, Windows & Mac as easily as running `npm run electron:os`.\n\nSo I clone the repository, install the dependencies & run it:\n\n```bash\ngit clone https://github.com/maximegris/angular-electron.git\nnpm install\nnpm start\n```\n\nWhich opens the following window:\n\n<p align=\"center\">\n  <img width=\"90%\" height=\"90%\" src=\"https://user-images.githubusercontent.com/15229355/33723183-db3892e0-db63-11e7-8cfe-5e68e3a345e8.png\">\n</p>\n\nNote the inspection tool on the right, that's because Electron uses **Chromium** to render my project, therefore I have access to the usual inspection tool.\n\n<br><br>\n\n### Tweaking everything to my liking\n\nThere are two things that I wish to change:\n\n- I'll use Sass instead of Scss\n- I want to use the CSS framework [Bulma](https://bulma.io/)\n\n<br>\n\n#### Scss to Sass\n\nAll I need to do is tell `angular-cli` that I'm using Sass instead of Scss, change the existing file extensions and change a line in the `webpack` configuration.\n\nI first run `ng set defaults.styleExt sass`, then I change the extensions of the following files: `styles.scss`, `app.component.scss`, `home.component.scss` without forgetting to adjust the syntax of their contents.  \nAnd finally, I head to `webpack.config.js` and update the following block:\n\n```javascript\nconst styles = [\"./src/styles.scss\"];\n```\n\nI can now use Sass in my Angular project.\n\n<br>\n\n#### Using Bulma\n\nFirst, run:  \n`npm install bulma`\n\nThen head to `styles.sass` and add the following lines:\n\n```sass\n@import ../node_modules/bulma/sass/utilities/initial-variables\n@import ../node_modules/bulma/sass/utilities/functions\n\n// Contents of the file\n\n@import \"~bulma\"\n```\n\nNow that everything is ready, I can start coding my application.\n\n<br><br>\n\n## Step 1: The initial requirements\n\nMy application will contains a navigation bar to move from one list to another and a content panel to display the TODOs (and their status).\n\nTherefore I'll need two distinct components, let's generate the nav with `angular-cli` and use the existing `home` component as our content panel:\n\n`ng g component nav`\n\nWhich generates a `nav` folder containing my template, style sheet, component and test files.\n\nAs my navigation is independent to the currently existing routing, I'll add it parallel to my `router-outlet` like such:\n\n```html\n<app-nav></app-nav> <router-outlet></router-outlet>\n```\n\nWhich displays:\n\n<p align=\"center\">\n  <img width=\"90%\" height=\"90%\" src=\"https://user-images.githubusercontent.com/15229355/33724972-c3f7d4d8-db68-11e7-9e3c-cc2bf780d83d.png\">\n</p>\n\n_Note the little \"nav works!\" on top of the window._\n\nLet's now make it look like an actual navigation bar:\n\n<p align=\"center\">\n  <img width=\"90%\" height=\"90%\" src=\"https://user-images.githubusercontent.com/15229355/33726862-308d767a-db6e-11e7-8265-0e8a48c06319.png\">\n</p>\n\nAs you can see, I have made some changes:\n\n- The navbar is now a section with a `fixed` position, containing several _Lists_ that will allow our user to navigate through the application.\n- I have added a background picture I find pretty, if you know where it is, please let me know :-)\n\n<br><br>\n\n## Step 2: The essential feature\n\nI now want to add actual Todos for each list and display them. Here is the current model for a `List`:\n\n```javascript\nexport class List {\n  // A list has a generic default name\n  name: string = \"New List\";\n  // Each list contains a list of Todos\n  todos: Todo[] = [];\n}\n```\n\nAnd the model for a Todo element:\n\n```javascript\nexport class Todo {\n  name: string = \"New TODO\";\n  description: string;\n  // A Todo element is either done or in progress\n  done: boolean = false;\n}\n```\n\nAll I have to do, is to add a button to create a new Todo, once clicked, I'll simply push a newly created `Todo` into my currently displayed `List`s array and display said array with an `ngFor`. With all of that said, here is the result:\n\n<p align=\"center\">\n  <img width=\"90%\" height=\"90%\" src=\"https://user-images.githubusercontent.com/15229355/33740261-f40fa0c2-db97-11e7-84e5-ff9520be882f.png\">\n</p>\n\nNote the undocumented changes such as the ability to create a new List (which uses the same concept applied to create a new Todo), the ability to mark a Todo as done and the ability to edit the name of a List. All of this is very basic and doesn't really need to be detailed.\n\n<br><br>\n\n## To be continued\n\nNext steps will involve having a clean and professional design, saving the TODOs locally (in order to retrieve them from one session to another) and many more steps to make this little application as perfect as it can be.\n"},"__N_SSG":true}