{"pageProps":{"frontmatter":{"title":"Deploy a project page or a custom subdomain on Github pages","description":"Using AWS Route 53 and Github pages.","date":"2017-10-02","slug":"/posts/subdomain-githubpages","isPublished":true},"content":"\nHave you noticed the URL of this blog?\n\nThe first part, namely `blog`, is called a **subdomain**, it's a subset - a smaller part of a larger domain. In fact, `www` is also a subdomain, but you can make your web address unique by replacing it with almost anything you want (without spending an additional penny !). This subdomain will allow you to point to a specific directory in your Github Pages directories in order to display specific content.\n\nIn this blog post, I'll simply demonstrate how I deployed a subdomain using **AWS** as my DNS (Domain name System) and **Github Pages** as my host. I will also demonstrate how to create a project page for your Github page.\n\n**There are two possible scenarios**: you either have a basic Github page or one with a custom domain.  \nIn the first scenario, you will be able to create a _project page_ that will work just like a normal subdomain but will be accessible like such: `username.github.io/project`.  \nIn the second scenario, you will be able to create a _subdomain_ that will be accessible in the normal way: `subdomain.website.com` (or any other extension you use).\n\n<br><br>\n\n## Step 1: Create a CNAME record pointing to your Github page\n\n#### Note: Only follow this step if you already have a custom domain set-up and wish to have a custom subdomain like the one used by this blog, otherwise, jump to step 2.\n\n#### Note (2): In this tutorial I use AWS Route 53 as my DNS of choice, but these steps can be done through any other DNS out there.\n\nHead over to your AWS DNS console (Route 53), then click on `Hosted zones`:\n\n<p align=\"center\">\n  <img width=\"70%\" height=\"70%\" src=\"https://user-images.githubusercontent.com/15229355/32547643-073c7f14-c47b-11e7-8c17-949cdc7c4d12.png\">\n</p>\n\nClick on the hosted zone to which you wish to add a subdomain, then click on `Create Record Set`:\n\n<p align=\"center\">\n  <img width=\"90%\" height=\"90%\" src=\"https://user-images.githubusercontent.com/15229355/32547711-4f933294-c47b-11e7-8038-2f24b7906946.png\">\n</p>\n\nAnd fill in the right-hand side form like such:\n\n<p align=\"center\">\n  <img width=\"90%\" height=\"90%\" src=\"https://user-images.githubusercontent.com/15229355/32547798-98972054-c47b-11e7-88db-468429af0912.png\">\n</p>\n\nWhere `Name` should contain your new subdomain's name (in my case `blog`), `Type` should be `CNAME - Canonical name` and `Value` should be your personnal Github pages URL.\n\nA `CNAME` record is simply used to specify that a domain name is an alias to another domain name.\n\n_Please keep in mind, that in my case, `christopherkade.github.io` actually uses the custom domain `christopherkade.com`_.\n\nFinally, create your Record Set. These changes may take up to two days to occur, but that does not stop us from continuing our work.\n\n<br><br>\n\n## Step 2: Create your project's Github repository and deploy it\n\nAll we have to do now, is create our project's repository and push its contents to the Github pages branch.\n\nSo head over to [Github](https://github.com/) and create the repository that will be used to serve the contents of your subdomain once it is accessed. Note that the repository's name will be the value used in your new URL (for example: call you repository `blog` if you wish to access it via `username.github.io/blog` or `blog.website.com`)\n\n#### Note: Only create the following file if you are working towards a custom subdomain, otherwise skip it.\n\nOnce this is done, add a `CNAME` file to the root of your project containing your new domain, in my case `blog.christopherkade.com`.\n\nThen push your work to the `gh-pages` branch, this will automatically build your project and deploy it to your page.\n\n```bash\n# clone your new repository\ngit clone https://github.com/username/repo-name.git\n\ncd repo-name\n\n# create an index.html file to make sure everything works\necho \"Hello World!\" >> index.html\n\n# create the gh-pages branch\ngit checkout -b gh-pages\n\n# add the contents of your directory\ngit add .\n\n# commit it all with a given message\ngit commit -m \"Initial commit\"\n\n# push it to the gh-pages branch\ngit push origin gh-pages\n```\n\nAfter a few seconds, your new subdomain should be up and running ! You can now fiddle around, creating a Jekyll blog or any other static website you can think of.\n\nYou can now access your project:\n\n`username.github.io/project`\n\nOr your sub-domain:\n\n`subdomain.website.extension`\n\n<br><br>\n\n## Summary\n\nWe have briefly learned a couple of things:\n\n- The various usages of a subdomain (and its significance)\n- How to create a CNAME record in our AWS DNS (and what it actually is)\n- How to deploy a project page or a new subdomain for our Github page\n\n<br><br>\n\n## Final thoughts\n\nThis is a repeatable process, you can deploy as many projects / subdomains as you want. This can be useful if you wish to showcase one of your projects, create a blog, or simply have a safe development repository (under a `dev` subdomain for example).\n\nThanks for reading,  \n[@christo_kade](https://twitter.com/christo_kade)\n"},"__N_SSG":true}