{"pageProps":{"frontmatter":{"title":"Automatically deploying your Storybook to Github Pages","description":"Deploy your Storybooks to Github Pages using Travis CI in a matter of minutes.","date":"2019-05-17","slug":"/posts/storybook","isPublished":true},"content":"\n[Storybook](https://storybook.js.org/) is a great tool, it allows you to organize your components into a neat little interface that looks something like [this](https://christopherkade.com/ReactCraft).  \nYou basically create _stories_ that take care of returning the component you want to display to your user.\n\nHere's an example of a story for a React component:\n\n```jsx\n//...\n\nimport { Button } from \"../components/Button\";\n\nstoriesOf(\"Button\", module)\n  .add(\"With text\", () => <Button>Enter World</Button>)\n  .add(\"With emojis\", () => <Button>🔥⚔️</Button>);\n```\n\nPretty simple stuff, of course, there are many ways of [customizing](https://storybook.js.org/docs/configurations/options-parameter/) your Storybook, from its theme to adding awesome [addons](https://storybook.js.org/docs/addons/addon-gallery/).\n\nBut this article is not an introduction to Storybook, if you want one I truly recommend Emma Wedekind's [\"Documenting React Components With Storybook\"](https://dev.to/emmawedekind/documenting-react-components-with-storybook-4h3b). Today, we'll deploy an existing Storybook to Github Pages like [this one](https://christopherkade.com/ReactCraft) while automating the process at each push on a given branch.\n\n<br><br>\n\n## Setting up Travis CI\n\nTravis CI is a continuous integration service that's used to build and test your software hosted on Github. It's free for open-source projects and will allow us to deploy to Github Pages super easily.\n\nThere are a few steps to follow before we can do all of that:\n\n1. Go to [travis-ci.com](http://travis-ci.com) and Sign up with GitHub.\n2. Accept the Authorization of Travis CI. You’ll be redirected to GitHub.\n3. Click the green Activate button, and select the repository you want to deploy\n4. Generate a personal access token on Github following the short instructions on this [link](https://help.github.com/en/articles/creating-a-personal-access-token-for-the-command-line) and give it the `public_repo` permissions.\n5. Go to your project's settings on Travis, in the environment variables section, create a `GITHUB_TOKEN` variable and give it the token you've just generated. This token will allow Travis to push to your repository in order to deploy.\n\n<div style=\"display: flex; align-items: center; justify-content: center\">\n<img width=\"70%\" alt=\"render of the component mentioned\" src=\"https://user-images.githubusercontent.com/15229355/57936079-78135700-78c3-11e9-8735-0aac4881d546.png\">\n</div>\n\nWe can now create a `.travis.yml` file at the root of our project and give it the following content:\n\n```yml\n# Tells Travis we're running on a Node environment\nlanguage: \"node_js\"\nnode_js: \"8\"\n\n# Script that is run before the script phase\nbefore_script:\n  - yarn build-storybook\n\n# Deployment information\ndeploy:\n  provider: pages # Tell Travis we want to deploy to Github Pages\n  skip-cleanup: true\n  github-token: $GITHUB_TOKEN # Will take the environment variable you created on step 5\n  local_dir: storybook-static # The folder that needs to be deployed\n  repo: christopherkade/ReactCraft # Add your username/project_name here\n  target_branch: gh-pages # Tell Travis to deploy on the gh-pages branch\n  on:\n    branch: master # Tell Travis to trigger a deploy only when we push to master\n```\n\n> Note: If you wish to trigger the deployment when pushing to a specific branch, feel free to change the `branch: master` section of the configuration file.\n\n<br><br>\n\n## Setting up our Storybook for deployment\n\nWe're almost done, we now need to export our Storybook into a static app. This way Travis will take care of pushing the generated app to our `gh-pages` branch, which will deploy it !\n\nIn your `package.json`, add the following script:\n\n```json\n{\n  \"scripts\": {\n    // ...\n    \"build-storybook\": \"build-storybook -s public\"\n  }\n}\n```\n\nThis script is the one run during our `before_script` phase in our `.travis.yml`. It will generate a `storybook-static` folder at the root of your project containing your website's static instance.\n\n<br><br>\n\n## Deploying your Storybook\n\nWe can now trigger our first deployment 😍\n\nPush your `package.json` and `.travis.yml` files to your repository.  \nIf everything goes according to plan you should see a build being triggered on your Travis dashboard. After a short while (give it a few minutes at first), if your build is shown as successful, you'll find your Storybook under the following URL: username.github.io/project-name.\n\nKeep in mind that a few things might make a build fail:\n\n1. Your tests failing\n2. Forgetting a step in this article, for example setting up the environment variable containing your Github token on your Travis project.\n3. Your linter throwing an error (if you have one set up)\n\nSo you can always fix these issues and push your changes to Github.\n\n<br>\n\nCongratulations on deploying your Storybook to Github Pages 🎉\n\nIf you have any questions or want to keep in touch, please feel free to follow me on Twitter [@christo_kade](https://twitter.com/christo_kade), I regularly post about JS and CSS there and will always inform you when new articles are out 😄\n"},"__N_SSG":true}